; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v8)
		(pred_6 ?v7)
		(pred_2 ?v6)
		(pred_1 ?v6)
		(pred_4 ?v7 ?v6)
		(pred_5)
		(pred_3 ?v7))

   (:action op_2
       :parameters  (?v5 ?v3)
       :precondition (and (not-eq ?v5 ?v3) 
                          (pred_2 ?v5) (pred_2 ?v3) (pred_1 ?v5))
       :effect (and  (pred_1 ?v3)
		     (not (pred_1 ?v5))))


   (:action op_1
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v2)
			    (pred_4 ?v4 ?v2) (pred_1 ?v2) (pred_5))
       :effect (and (pred_3 ?v4)
		    (not (pred_4 ?v4 ?v2)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v2)
			    (pred_3 ?v4) (pred_1 ?v2))
       :effect (and (pred_4 ?v4 ?v2)
		    (pred_5)
		    (not (pred_3 ?v4)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_04 obj_03 obj_02 
          obj_05 obj_01 
)
(:init
(pred_2 obj_04)
(pred_2 obj_03)
(pred_2 obj_02)
(pred_6 obj_05)
(pred_6 obj_01)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(pred_5)
(pred_4 obj_05 obj_03)
(pred_4 obj_01 obj_02)
(pred_1 obj_04)
)
(:goal
(and
(pred_4 obj_05 obj_02)
(pred_4 obj_01 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_05 obj_02) (pred_1 obj_04))
    (sometime-before  (pred_4 obj_01 obj_04) (pred_1 obj_03))
  )
)
)

; plan
1. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
2. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_05 obj_03) (pred_5)
   added: (pred_3 obj_05)
   goals met: 0 of 2
3. (op_2 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 0 of 2
4. (op_3 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05 obj_02) (pred_5)
   goals met: 1 of 2
5. (op_1 obj_01 obj_02)
   deleted: (pred_4 obj_01 obj_02) (pred_5)
   added: (pred_3 obj_01)
   goals met: 1 of 2
6. (op_2 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 1 of 2
7. (op_3 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_4 obj_01 obj_04) (pred_5)
   goals met: 2 of 2
